[
  "Пользователь отправляет запрос на восстановление пароля в мобильном приложении. Система генерирует временный код, отправляет его по SMS и ожидает ввода кода пользователем для перехода к форме установки нового пароля.",
  "Менеджер проекта создает задачу в Jira и назначает её разработчику. Разработчик выполняет код, создает Pull Request, а после одобрения тестировщиком система автоматически выполняет деплой на тестовый сервер.",
  "Клиент оформляет заказ в интернет-магазине. Система проверяет наличие товара на складе: если товар есть, резервирует его и отправляет счет на оплату, в противном случае предлагает пользователю предзаказ.",
  "Сотрудник подает заявку на отпуск через корпоративный портал. HR-менеджер проверяет остаток дней, руководитель подразделения одобряет запрос, после чего система пересчитывает баланс отпуска и уведомляет бухгалтерию.",
  "При поступлении баг-репорта техподдержка классифицирует его по критичности. Исправление передается в отдел разработки, где после фикса выполняется регрессионное тестирование перед закрытием тикета.",
  "Процесс CI/CD начинается с пуша кода в репозиторий. Автоматизированная система запускает юнит-тесты; если они пройдены успешно, строится Docker-образ, который затем разворачивается в стейджинг-окружении.",
  "Для регистрации в финтех-приложении пользователь загружает скан паспорта. Система распознавания текста извлекает данные, которые затем проверяет сотрудник службы безопасности в течение 24 часов.",
  "Отдел маркетинга запускает рассылку: система выбирает сегмент аудитории из базы данных, отправляет письма и в течение трех дней собирает статистику по кликам для формирования итогового отчета.",
  "Система мониторинга обнаруживает высокую нагрузку на CPU сервера. Она автоматически инициирует запуск дополнительного инстанса в облаке и перераспределяет трафик через Load Balancer, уведомляя администратора.",
  "Студент подает заявку на курс через сайт. Куратор проверяет наличие свободных мест: если места есть, выставляется ссылка на оплату, а после подтверждения транзакции студенту открывается доступ к личному кабинету.",
  "Процесс обработки API-запроса: шлюз проверяет API-ключ, при успехе направляет запрос к микросервису базы данных, получает результат, кеширует его в Redis и возвращает ответ клиенту в формате JSON.",
  "Пользователь подписывается на trial-версию сервиса. Через 14 дней система проверяет наличие привязанной карты: если карта есть, списывается сумма за месяц подписки, если нет — доступ блокируется.",
  "При получении заявки на возврат товара, менеджер проверяет срок покупки. Если 14 дней не прошло, оформляется возврат денег на карту и складская система ставит задачу на приемку товара от курьера.",
  "Администратор базы данных инициирует ночной бэкап. Система создает дамп данных, архивирует его, отправляет в облачное хранилище S3 и записывает лог о результате операции в системный журнал.",
  "Для публикации статьи в блоге автор загружает черновик. Редактор вносит правки и возвращает на доработку или одобряет; после одобрения корректор проверяет текст, и система публикует его в заданное время.",
  "В системе документооборота создается договор. Он последовательно проходит согласование у юриста и финансового директора; если один из них отклоняет документ, автор получает уведомление на доработку.",
  "Клиент запрашивает выписку по счету за год. Банковская система ставит задачу в очередь на генерацию PDF-файла, после чего отправляет ссылку на скачивание во внутренний чат приложения и на email.",
  "Техник проводит плановое обслуживание сервера. Перед началом он переключает трафик на резервный узел, выполняет диагностику, обновляет ПО и только после успешных тестов возвращает сервер в работу.",
  "При регистрации нового сотрудника системный администратор создает аккаунт в Active Directory. Затем скрипт автоматически создает почтовый ящик в Exchange и выдает доступы к корпоративному Slack и Confluence.",
  "Издательство принимает рукопись: рецензент оценивает материал, и если оценка положительная, заключается контракт с автором, после чего макет передается в типографию для печати тиража.",
  "Пользователь оформляет подписку на онлайн-кинотеатр. Система проверяет регион пользователя; если контент доступен, открывается плеер, в противном случае выводится сообщение о территориальных ограничениях.",
  "Бронирование переговорной комнаты: сотрудник выбирает время в календаре. Система проверяет конфликты: если время свободно, бронь подтверждается и на e-mail участников отправляется приглашение.",
  "Обработка входящего инвойса: бухгалтер сканирует документ, система OCR распознает сумму и контрагента, данные сверяются с реестром заказов, и при совпадении формируется платежное поручение.",
  "Разработчик запрашивает доступ к базе данных 'Production'. Тимлид одобряет запрос, после чего безопасник выдает временный токен доступа на 4 часа, который автоматически аннулируется по истечении времени.",
  "Клиент оставляет отзыв на сайте. Модератор проверяет его на наличие нецензурной лексики: если отзыв чист, он публикуется, а если содержит жалобу — автоматически создается тикет для службы поддержки.",
  "В онлайн-банке пользователь настраивает автоплатеж за ЖКХ. Ежемесячно система проверяет баланс счета: если средств достаточно, проводится транзакция, иначе отправляется PUSH-уведомление о нехватке денег.",
  "Система антифрода анализирует транзакцию по карте. Если сумма превышает лимит или место совершения подозрительно, транзакция блокируется и клиенту поступает звонок от автоматического оператора для подтверждения.",
  "Для обновления мобильного приложения разработчик загружает билд в App Store Connect. Рецензенты Apple проводят проверку, после чего приложение либо отклоняется с указанием причин, либо выпускается в стор.",
  "Сотрудник заказывает канцелярские товары. Завхоз собирает заявки неделю, затем формирует общий заказ поставщику; после доставки товары распределяются по кабинетам согласно исходным заявкам.",
  "Система 'Умный дом' отслеживает датчик протечки воды. При срабатывании система перекрывает электромагнитный клапан на трубе, включает звуковую сирену и отправляет срочное уведомление владельцу на телефон.",
  "При увольнении сотрудника HR инициирует 'обходной лист'. ИТ-отдел блокирует учетные записи, хоз-отдел принимает пропуск и ноутбук, а бухгалтерия производит финальный расчет в день увольнения.",
  "Инвестор открывает брокерский счет. Система проводит KYC-проверку, открывает счета в депозитарии и привязывает банковский счет для вывода средств, уведомляя об успешном открытии по SMS.",
  "Логистическая компания принимает груз. Диспетчер назначает водителя и автомобиль, система строит оптимальный маршрут и отправляет данные в мобильное приложение водителя для начала поездки.",
  "При попытке несанкционированного доступа к консоли администратора, система блокирует IP-адрес на 24 часа и отправляет отчет об инциденте в отдел информационной безопасности на аудит.",
  "Кандидат откликается на вакансию. Рекрутер проводит скрининг резюме, назначает техническое интервью с разработчиком; по результатам интервью принимается решение о найме или отказе.",
  "Пользователь Яндекс.Драйв завершает аренду авто. Система проверяет закрытие дверей и уровень топлива, рассчитывает итоговую стоимость поездки и списывает средства с привязанной карты.",
  "Продавец добавляет новый товар на маркетплейс. Контент-менеджер проверяет описание и фото; если всё соответствует стандартам, товар переходит в статус 'Активен' и появляется в поиске на сайте.",
  "Система управления складом (WMS) получает заказ на сборку. Кладовщик сканирует QR-коды товаров при упаковке в коробку, распечатывает этикетку доставки и перемещает заказ в зону отгрузки.",
  "IoT-датчик на парковке фиксирует заезд машины. Система отмечает место как занятое в базе данных и обновляет табло на въезде, показывая актуальное количество свободных мест.",
  "Клиент заказывает кастомизированный ноутбук. Менеджер уточняет детали комплектации, инженер собирает устройство, а отдел тестирования проверяет работоспособность перед отправкой клиенту.",
  "При публикации видео на YouTube алгоритм проверяет его на нарушение авторских прав. Если музыка защищена, накладываются ограничения на монетизацию, иначе видео становится доступным для всех.",
  "Сотрудник техподдержки получает запрос на изменение тарифа. Он проверяет отсутствие задолженности, переключает тариф в биллинговой системе и отправляет обновленное соглашение на email клиента.",
  "HR-департамент инициирует процесс ежегодной оценки '360'. Сотрудник заполняет самоанкету, коллеги пишут отзывы, руководитель подводит итоги и проводит личную встречу для обсуждения результатов.",
  "Система Backup Recovery проверяет целостность архивов. Раз в месяц запускается тестовое восстановление на виртуальную машину; если ОС загрузилась, отчет об успешности отправляется CTO.",
  "Пациент записывается к врачу через сайт клиники. Система проверяет расписание: если время занято, предлагает альтернативы; при подтверждении отправляет напоминание в WhatsApp за час до приема.",
  "Страховая компания обрабатывает случай ДТП. Клиент загружает фото повреждений, эксперт оценивает ущерб, и после согласования суммы юрист готовит документы на выплату компенсации.",
  "Пользователь запрашивает перенос домена к другому регистратору. Система проверяет статус домена ('unlocked'), отправляет код авторизации на почту владельца и ожидает подтверждения от принимающей стороны.",
  "Ресторан получает заказ через агрегатор. Повар подтверждает прием, готовит блюдо, отмечает готовность, после чего система вызывает свободного курьера для доставки по указанному адресу.",
  "Процесс ежемесячного закрытия отчетности: бухгалтер собирает все акты, сверяет их с банковскими выписками, формирует налоговую декларацию и отправляет её через систему 'Контур' в ФНС.",
  "При добавлении комментария в соцсети, спам-фильтр проверяет текст по базе стоп-слов. Если спам обнаружен, комментарий скрывается, а аккаунт пользователя помечается для проверки модератором.",
  "Сотрудник в командировке собирает чеки. По возвращении он создает отчет о расходах, бухгалтерия проверяет обоснованность трат и перечисляет возмещение на зарплатную карту сотрудника.",
  "Для проведения вебинара спикер создает мероприятие. Слушатели регистрируются, получают ссылку на трансляцию; после вебинара система автоматически рассылает всем участникам запись и презентацию.",
  "Система 'Умный склад' отслеживает остатки на полках. Когда количество товара падает ниже критического уровня, система автоматически генерирует заказ поставщику и отправляет его на e-mail.",
  "Пользователь подает жалобу на контент в соцсети. Система передает жалобу модератору; если нарушение подтверждается, контент удаляется, а автору выносится предупреждение или бан.",
  "Сервис такси рассчитывает стоимость поездки. Учитывается расстояние, текущий спрос и погодные условия; после согласия клиента система ищет ближайшего водителя и отправляет ему заказ.",
  "При покупке билета в кино, зритель выбирает места на схеме зала. Система блокирует эти места на 10 минут для оплаты; если транзакция не прошла, места снова становятся вакантными.",
  "Внутренний аудит безопасности проверяет учетные записи. Если сотрудник не заходил в систему более 90 дней, его аккаунт автоматически деактивируется, а руководителю отправляется уведомление.",
  "Разработчик использует Feature Toggle для новой функции. В конфигурационном файле меняется значение, система перечитывает конфиг на лету и открывает доступ к фиче для 5% пользователей.",
  "Клиент банка хочет повысить лимит по кредитной карте. Скорринговая система запрашивает данные из БКИ, анализирует доходы и выносит решение: отказать или установить новый лимит автоматически.",
  "Для участия в тендере компания готовит пакет документов. Тендерный комитет вскрывает конверты, оценивает предложения по критерию 'цена/качество' и публикует протокол о выборе победителя.",
  "Система мониторинга обнаруживает утечку памяти в приложении. Она выполняет автоматический перезапуск (restart) пода в Kubernetes и отправляет дамп памяти в Sentry для анализа разработчиками.",
  "Сотрудник запрашивает новый ноутбук. Технический директор одобряет покупку, отдел закупок заказывает модель, а после поставки системный администратор устанавливает необходимое ПО для работы.",
  "Процесс онбординга нового клиента в SaaS: после оплаты система создает отдельное пространство (tenant), импортирует базовые настройки и отправляет администратору клиента логин и пароль.",
  "Головной офис рассылает распоряжение филиалам. Директоры филиалов подтверждают получение, назначают ответственных за исполнение и отчет об исполнении загружают в общую систему мониторинга.",
  "Для смены электронной почты в аккаунте пользователь вводит новый адрес. Система отправляет письмо с подтверждением на старую почту и на новую; смена происходит только после клика по обеим ссылкам.",
  "Веб-мастер подает заявку в рекламную сеть. Модератор проверяет посещаемость сайта и качество контента; если сайт соответствует правилам, выдается JS-код для размещения рекламных блоков.",
  "Пользователь стриминга хочет скачать трек офлайн. Система проверяет наличие премиум-подписки: если она активна, файл загружается в зашифрованный кеш, иначе предлагается купить подписку.",
  "При обнаружении вируса на компьютере сотрудника, антивирус блокирует сетевой трафик устройства и уведомляет SOC-центр; специалист по ИБ проводит удаленную очистку и снимает блокировку.",
  "Студент сдает лабораторную работу в GitHub Classroom. Автотесты проверяют код: если тесты пройдены, работа помечается как выполненная, преподаватель получает уведомление для финальной проверки.",
  "Компания проводит опрос удовлетворенности клиентов. Робот обзванивает базу, распознает ответы; если оценка низкая, звонок перехватывает оператор для уточнения причин недовольства.",
  "При регистрации домена .ru регистратор проверяет наличие паспортных данных. Если данные не предоставлены в течение 3 дней, делегирование домена приостанавливается до исправления нарушения.",
  "Система документооборота подписывает файл КЭП. Сервер проверки сертификатов подтверждает валидность подписи, после чего файл архивируется и штампуется меткой времени (timestamp).",
  "Отдел продаж получает 'лид' с сайта. CRM назначает ответственного менеджера, который должен позвонить в течение 15 минут; если звонок не совершен, лид передается другому менеджеру.",
  "Пользователь запрашивает удаление своего аккаунта (GDPR). Система помечает данные на удаление, через 30 дней проверяет отсутствие активных споров и окончательно стирает информацию из БД.",
  "Для получения справки о доходах сотрудник пишет боту в Slack. Бот запрашивает период, формирует задачу для бухгалтера, а когда справка готова — присылает скан в личные сообщения боту.",
  "Приложение электронной почты группирует письма. Алгоритм анализирует отправителя и тему: спам улетает в корзину, уведомления от соцсетей — в папку 'Промо', личные сообщения — во 'Входящие'.",
  "Сотрудник HR обновляет штатное расписание. После внесения правок система уведомляет финансовый отдел о необходимости корректировки фонда оплаты труда на следующий квартал.",
  "Пользователь бронирует столик в ресторане через приложение. Администратор получает пуш, проверяет наличие стола и подтверждает бронь; за 2 часа до времени посещения клиенту летит SMS-напоминание.",
  "В системе управления проектами 'баг' переводится в статус 'Ready for QA'. Тестировщик проверяет исправление на стенде; если баг воспроизводится, он возвращает его разработчику с комментарием.",
  "Интернет-провайдер фиксирует обрыв кабеля. Система определяет затронутые дома, создает заявку для выездной бригады и рассылает абонентам SMS о примерных сроках восстановления связи.",
  "При покупке игры в Steam пользователь может запросить возврат. Если наиграно менее 2 часов и прошло менее 14 дней, система автоматически одобряет возврат и возвращает деньги на кошелек.",
  "Система авто-масштабирования (HPA) в Kubernetes следит за очередью задач. Если в очереди более 1000 сообщений, запускаются дополнительные воркеры, после очистки очереди лишние воркеры удаляются.",
  "Клиент заказывает лекарства через аптечную сеть. Провизор собирает заказ; если нужного препарата нет, он предлагает аналог по телефону; после сборки заказ передается в пункт выдачи.",
  "Для прохода в офис используется система распознавания лиц. Камера делает снимок, нейросеть сравнивает его с базой; при совпадении турникет открывается, иначе вызывается охранник.",
  "Налоговая инспекция рассылает требования об уплате. Если в течение 30 дней оплата не поступила, система автоматически формирует поручение банку на списание средств со счета должника.",
  "Бухгалтер начисляет зарплату. Система рассчитывает НДФЛ и взносы, формирует реестр для банка; после одобрения директором банк переводит деньги на счета сотрудников одним реестром.",
  "Пользователь хочет сменить тему интерфейса в приложении. Он выбирает 'Темную тему' в настройках; система обновляет CSS-переменные, сохраняет выбор в профиль и мгновенно перерисовывает экран.",
  "Для проведения верификации банковской карты система списывает случайную сумму до 10 рублей. Пользователь вводит сумму списания в приложении; если она верна, карта считается проверенной.",
  "Сотрудник склада проводит инвентаризацию. Он сканирует каждый товар терминалом сбора данных (ТСД), после чего система сравнивает фактическое количество с учетным и выводит расхождения.",
  "При публикации поста в Telegram-канале через бота, бот сначала отправляет пост на утверждение владельцу канала. Только после нажатия кнопки 'Опубликовать' пост улетает в канал.",
  "Система управления трафиком в городе анализирует пробки. Если на участке затор, время работы зеленого сигнала светофора на перекрестке увеличивается автоматически на 20 секунд.",
  "Пользователь скачивает файл из облака. Система генерирует временную подписанную ссылку (signed URL), которая действует 5 минут, и направляет браузер по этой ссылке для начала загрузки.",
  "При добавлении нового устройства в сеть 'Умный дом', оно отправляет широковещательный запрос. Контроллер обнаруживает устройство, присваивает ему IP и просит пользователя ввести имя для него.",
  "Отдел PR готовит пресс-релиз. Текст проходит проверку у юристов и руководства, после чего рассылается по базе СМИ и публикуется в разделе 'Новости' на официальном сайте компании.",
  "Пользователь хочет перевести деньги по номеру телефона (СБП). Он вводит номер, система находит банк-получатель, уточняет имя получателя и после подтверждения пользователем делает перевод.",
  "Редактор Википедии вносит правку. Патрулирующий проверяет изменения; если они достоверны и корректны, правка принимается, иначе откатывается к предыдущей версии с указанием причины.",
  "В приложении для фитнеса пользователь запускает тренировку. Система записывает пульс с часов, считает калории и по завершении сохраняет тренировку в облаке, показывая статистику за неделю.",
  "Для обновления прошивки IoT-устройства, облако отправляет сигнал о наличии новой версии. Устройство скачивает файл, проверяет контрольную сумму и выполняет перезагрузку для установки.",
  "Менеджер по продажам создает коммерческое предложение в Word. Система автоматизации конвертирует его в PDF, добавляет печать компании и отправляет ссылку на документ клиенту в CRM.",
  "Приложение 'Музыка' подбирает рекомендации для пользователя. Алгоритм анализирует историю прослушиваний за неделю и каждый понедельник генерирует новый плейлист 'Открытия недели'."
]